docs/update_date.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-07 Wed 19:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>update_date</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">update_date</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0e380d4">NAME</a></li>
<li><a href="#orgf01a771">SYNOPSIS</a></li>
<li><a href="#org1e0c781">DESCRIPTION</a></li>
<li><a href="#orge079b27">Optional Arguments</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0e380d4" class="outline-2">
<h2 id="org0e380d4">NAME</h2>
<div class="outline-text-2" id="text-org0e380d4">
<p>
update_date - Retreive current date and optionally, set current date.
</p>
</div>
</div>

<div id="outline-container-orgf01a771" class="outline-2">
<h2 id="orgf01a771">SYNOPSIS</h2>
<div class="outline-text-2" id="text-orgf01a771">
<p>
update_date.sh -h
</p>

<p>
update_date.sh &#x2013;help
</p>

<p>
update_date.sh [Optional Arguments &#x2026;] [SOURCE]
</p>
</div>
</div>

<div id="outline-container-org1e0c781" class="outline-2">
<h2 id="org1e0c781">DESCRIPTION</h2>
<div class="outline-text-2" id="text-org1e0c781">
<p>
Retreive current date and optionally, set current date.
Further, super-user privilege is requested to set time.
This is especially useful from behind a proxy server.
</p>
</div>
</div>

<div id="outline-container-orge079b27" class="outline-2">
<h2 id="orge079b27">Optional Arguments</h2>
<div class="outline-text-2" id="text-orge079b27">
<p>
-h                          Print usage message and exit
</p>

<p>
&#x2013;help                      Print this help message and exit
</p>

<p>
-s|&#x2013;set-time               Set time [default: offer interactively]
</p>

<p>
-g|&#x2013;get-time               Get time (don't offer to set time)
</p>

<p>
-m TIME|&#x2013;manual TIME       Pass TIME manually
</p>


<p>
Optional Positional Argument:
</p>

<p>
SOURCE                      source domain [default: <a href="https://gnu.org">https://gnu.org</a> ]
</p>
</div>
</div>
</div>
</body>
</html>
